let failed = SecurityEvent
| where EventID == 4625
| summarize FailedCount = count() by TargetUserName, IpAddress, bin(TimeGenerated, 5m);

let success = SecurityEvent
| where EventID == 4624;

failed
| join kind=inner (success) on TargetUserName
| where success_TimeGenerated between (TimeGenerated .. TimeGenerated + 5m)
| project TargetUserName, IpAddress, FailedCount, FailedTime=TimeGenerated, SuccessTime=success_TimeGenerated