SecurityEvent
| where EventID == 4688
| where NewProcessName has_any ("powershell.exe","pwsh.exe")
| where CommandLine has_any ("-enc","EncodedCommand","IEX","Invoke-WebRequest","DownloadString","FromBase64String")
| project TimeGenerated, Computer, Account, NewProcessName, CommandLine, ParentProcessName
| sort by TimeGenerated desc